[
  {
    "id": 1,
    "slug": "transform-your-chicago-backyard-with-professional-landscaping",
    "title": "Transform Your Chicago Backyard with Professional Landscaping",
    "date": "2024-03-15",
    "intro": "Discover how professional landscaping can turn your Chicago backyard into a beautiful outdoor oasis. Learn about the best plants, materials, and design elements that thrive in Illinois weather.",
    "content": "<p>Your backyard is an extension of your home, and with Chicago's unique climate, creating a beautiful outdoor space requires expertise and planning. At M. Dailey Landscaping & Design, we specialize in transforming ordinary backyards into extraordinary outdoor living spaces.</p><h2>Understanding Chicago's Climate</h2><p>Chicago's climate presents unique challenges for landscaping. With cold winters, hot summers, and variable spring weather, choosing the right plants and materials is crucial. Native plants like Black-Eyed Susans, Purple Coneflowers, and Little Bluestem grass are excellent choices that can withstand our harsh winters.</p><h2>Design Elements That Work</h2><p>A well-designed backyard incorporates multiple elements: hardscaping for structure, softscaping for beauty, and functional spaces for entertainment. Consider adding a paver patio for outdoor dining, a fire pit for cool evenings, and strategic lighting to extend your outdoor time.</p><h2>Seasonal Maintenance</h2><p>Professional landscaping isn't just about the initial installation. Regular maintenance ensures your investment stays beautiful year-round. From spring cleanup to fall preparation, proper care makes all the difference.</p><p>Ready to transform your backyard? Contact us today for a free consultation!</p>"
  },
  {
    "id": 2,
    "slug": "complete-guide-to-retaining-walls-for-chicago-homes",
    "title": "Complete Guide to Retaining Walls for Chicago Homes",
    "date": "2024-03-10",
    "intro": "Retaining walls serve both functional and aesthetic purposes. This comprehensive guide covers everything Chicago homeowners need to know about retaining wall installation, materials, and design.",
    "content": "<p>Retaining walls are essential for managing slopes, preventing erosion, and creating usable outdoor spaces in Chicago properties. Whether you're dealing with a sloped yard or want to create terraced garden beds, a well-built retaining wall is a smart investment.</p><h2>Why Retaining Walls Matter</h2><p>In Chicago's climate, proper drainage and erosion control are critical. Retaining walls help manage water runoff during spring thaws and heavy rains, protecting your property's foundation and preventing soil erosion.</p><h2>Material Options</h2><p>We work with various materials including modular concrete blocks, natural stone, brick pavers, and timber. Each material has unique benefits - modular blocks are cost-effective and durable, while natural stone offers timeless elegance.</p><h2>Design Considerations</h2><p>A properly designed retaining wall considers height, drainage, soil type, and aesthetics. Walls over 4 feet typically require engineering and permits. Our team handles all aspects of the design and permitting process.</p><h2>Installation Process</h2><p>Professional installation includes proper base preparation, drainage solutions, and quality materials. We ensure your retaining wall will last for decades, even through Chicago's freeze-thaw cycles.</p>"
  },
  {
    "id": 3,
    "slug": "paver-patio-design-ideas-for-outdoor-entertaining",
    "title": "Paver Patio Design Ideas for Outdoor Entertaining",
    "date": "2024-03-05",
    "intro": "Create the perfect outdoor entertainment space with a custom paver patio. Explore design patterns, material options, and layout ideas that work beautifully in Chicago backyards.",
    "content": "<p>A paver patio extends your living space outdoors and creates the perfect setting for entertaining friends and family. From intimate dinner parties to large gatherings, the right patio design makes all the difference.</p><h2>Popular Paver Patterns</h2><p>Herringbone patterns offer classic elegance and structural stability. Running bond patterns create a more contemporary look. Circular patterns make stunning focal points around fire pits or water features.</p><h2>Material Selection</h2><p>Concrete pavers offer affordability and variety in colors and textures. Natural stone pavers like bluestone or travertine provide premium aesthetics. Brick pavers deliver timeless charm. We'll help you choose materials that match your home's style and budget.</p><h2>Functional Features</h2><p>Consider incorporating a fire pit for cool evenings, built-in seating for convenience, outdoor kitchens for serious entertainers, and pergolas for shade and ambiance.</p><h2>Lighting Design</h2><p>Proper lighting extends the usability of your patio into the evening hours. We incorporate pathway lights for safety, uplighting for trees and architectural features, and string lights for ambiance.</p><p>Ready to create your dream patio? Let's discuss your vision!</p>"
  },
  {
    "id": 4,
    "slug": "spring-landscaping-checklist-for-chicago-homeowners",
    "title": "Spring Landscaping Checklist for Chicago Homeowners",
    "date": "2024-02-28",
    "intro": "Spring is the perfect time to prepare your Chicago landscape for the growing season. Follow this comprehensive checklist to ensure your yard looks its best all year long.",
    "content": "<p>As Chicago's harsh winter finally releases its grip, it's time to prepare your landscape for spring. This checklist will help you tackle essential tasks and set your property up for success.</p><h2>Early Spring Tasks (March)</h2><p>Remove winter debris and fallen branches. Assess winter damage to plants and hardscaping. Clean gutters and downspouts. Apply dormant oil to fruit trees if needed.</p><h2>Mid-Spring Tasks (April)</h2><p>Prune dead branches from trees and shrubs. Edge garden beds and refresh mulch. Test and repair irrigation systems. Fertilize lawn and early-blooming perennials. Plant cool-season vegetables.</p><h2>Late Spring Tasks (May)</h2><p>Plant annuals after the last frost (typically mid-May in Chicago). Divide overcrowded perennials. Apply pre-emergent weed control. Monitor for pests and diseases. Mow regularly as grass starts active growth.</p><h2>Professional Services</h2><p>While many tasks can be DIY, professional spring cleanup saves time and ensures nothing is overlooked. We offer comprehensive spring packages that include all these services plus expert recommendations for your specific property.</p>"
  },
  {
    "id": 5,
    "slug": "artificial-turf-vs-natural-grass-chicago-comparison",
    "title": "Artificial Turf vs. Natural Grass: A Chicago Comparison",
    "date": "2024-02-20",
    "intro": "Considering artificial turf for your Chicago property? Learn about the pros and cons of synthetic grass versus natural lawns in our climate, including maintenance, cost, and environmental factors.",
    "content": "<p>The debate between artificial turf and natural grass is particularly relevant in Chicago, where lawn maintenance can be challenging due to extreme weather conditions. Let's examine both options.</p><h2>Artificial Turf Benefits</h2><p>No mowing, watering, or fertilizing required. Stays green year-round. Pet-friendly with excellent drainage. Eliminates mud and bare spots. Ideal for shady areas where grass struggles.</p><h2>Natural Grass Benefits</h2><p>Natural cooling effect on hot days. Carbon dioxide absorption and oxygen production. Natural feel underfoot. Lower initial installation cost. Preferred for sports and heavy play.</p><h2>Cost Comparison</h2><p>Artificial turf requires higher upfront investment ($8-15 per square foot installed) but eliminates ongoing maintenance costs. Natural grass has lower initial costs but requires regular mowing, watering, fertilizing, and occasional overseeding.</p><h2>Chicago Climate Considerations</h2><p>In Chicago's climate, artificial turf handles freeze-thaw cycles well with proper installation. Natural grass goes dormant in winter but rebounds each spring. Both options have merit depending on your priorities.</p><h2>Making the Decision</h2><p>Consider your budget, available time for maintenance, how you use your yard, and aesthetic preferences. We offer both installation services and can help you decide what's best for your property.</p>"
  },
  {
    "id": 6,
    "slug": "water-features-that-enhance-chicago-landscapes",
    "title": "Water Features That Enhance Chicago Landscapes",
    "date": "2024-02-15",
    "intro": "Add tranquility and value to your Chicago property with professionally installed water features. Explore options from pondless waterfalls to koi ponds and decorative fountains.",
    "content": "<p>Water features add a focal point to your landscape while creating a soothing atmosphere. From the gentle trickle of a fountain to the dramatic cascade of a waterfall, water features transform ordinary yards into peaceful retreats.</p><h2>Pondless Waterfalls</h2><p>Perfect for families with young children or limited space, pondless waterfalls provide the sight and sound of flowing water without a standing water reservoir. They require minimal maintenance and are easy to winterize for Chicago's cold months.</p><h2>Koi Ponds</h2><p>Koi ponds add life and color to your landscape. These beautiful fish are hardy and can survive Chicago winters with proper pond depth (at least 3 feet) and aeration. Spring and fall maintenance is essential for healthy fish.</p><h2>Decorative Fountains</h2><p>From modern geometric designs to classical tiered fountains, these features work well in formal gardens or as entryway focal points. Many are self-contained and easy to install.</p><h2>Natural Swimming Ponds</h2><p>A growing trend, natural swimming ponds use plants and beneficial bacteria for filtration instead of chemicals. They blend seamlessly into naturalistic landscapes and provide a unique swimming experience.</p><h2>Maintenance Considerations</h2><p>All water features require seasonal maintenance. We offer spring startup, regular cleaning, and fall winterization services to keep your investment looking and functioning beautifully.</p>"
  },
  {
    "id": 7,
    "slug": "drainage-solutions-for-wet-chicago-yards",
    "title": "Drainage Solutions for Wet Chicago Yards",
    "date": "2024-02-10",
    "intro": "Standing water and soggy yards are common problems in Chicago. Discover effective drainage solutions that protect your property and create usable outdoor space.",
    "content": "<p>Poor drainage is one of the most common landscaping problems we encounter in Chicago. Spring snowmelt and summer thunderstorms can leave yards waterlogged for days, damaging plants, creating mosquito breeding grounds, and making your yard unusable.</p><h2>Signs of Drainage Problems</h2><p>Standing water after rain. Soggy, spongy lawn areas. Water pooling near foundation. Erosion channels in yard. Plants showing signs of overwatering. Basement moisture or flooding.</p><h2>French Drain Systems</h2><p>The most effective solution for many drainage issues, French drains use perforated pipes surrounded by gravel to redirect water away from problem areas. They work invisibly underground and handle large water volumes.</p><h2>Dry Creek Beds</h2><p>Combining function with beauty, dry creek beds provide drainage while adding a natural design element. We use river rock and strategic plantings to create attractive features that guide water safely away.</p><h2>Grading Solutions</h2><p>Sometimes the solution is simple: reshaping your yard to direct water away from structures and toward appropriate drainage areas. Proper grading is the foundation of good drainage.</p><h2>Rain Gardens</h2><p>These shallow depressions planted with water-tolerant native plants capture and filter runoff naturally. They're environmentally friendly and attractive alternatives to conventional drainage.</p>"
  },
  {
    "id": 8,
    "slug": "native-plants-for-low-maintenance-chicago-gardens",
    "title": "Native Plants for Low-Maintenance Chicago Gardens",
    "date": "2024-02-05",
    "intro": "Native plants are naturally adapted to Chicago's climate and require minimal care once established. Discover the best native species for creating beautiful, sustainable landscapes.",
    "content": "<p>Native plants have evolved to thrive in Chicago's specific climate, soil, and ecosystem. They require less water, fertilizer, and pest control than exotic species while providing essential habitat for local wildlife.</p><h2>Top Native Perennials</h2><p>Purple Coneflower (Echinacea purpurea) - Beautiful purple blooms, extremely drought tolerant. Black-Eyed Susan (Rudbeckia hirta) - Bright yellow flowers, self-seeding. Wild Bergamot (Monarda fistulosa) - Attracts butterflies and hummingbirds. Prairie Dropseed (Sporobolus heterolepis) - Graceful ornamental grass.</p><h2>Native Shrubs</h2><p>Serviceberry (Amelanchier) - Spring flowers, edible berries, fall color. Ninebark (Physocarpus opulifolius) - Low maintenance, interesting bark texture. Spicebush (Lindera benzoin) - Early spring blooms, fragrant foliage.</p><h2>Native Trees</h2><p>Red Maple (Acer rubrum) - Stunning fall color, fast-growing. White Oak (Quercus alba) - Long-lived, provides shade and wildlife value. River Birch (Betula nigra) - Attractive peeling bark, tolerates wet conditions.</p><h2>Design Tips</h2><p>Group plants with similar water needs. Layer plants by height for visual interest. Include plants that bloom at different times for season-long color. Consider four-season interest with plants offering winter structure.</p><h2>Establishment Care</h2><p>While native plants are low-maintenance once established, they need regular watering during their first growing season. After that, most can survive on natural rainfall alone.</p>"
  },
  {
    "id": 9,
    "slug": "outdoor-lighting-design-for-chicago-homes",
    "title": "Outdoor Lighting Design for Chicago Homes",
    "date": "2024-01-30",
    "intro": "Professional outdoor lighting enhances safety, security, and aesthetics while extending the usability of your outdoor spaces. Learn about lighting techniques and fixture options.",
    "content": "<p>Well-designed outdoor lighting transforms your property after dark, highlighting architectural features, illuminating pathways, and creating ambiance for outdoor living spaces.</p><h2>Types of Outdoor Lighting</h2><p>Path Lighting - Guides visitors safely along walkways and driveways. Spotlights - Highlight trees, sculptures, or architectural features. Well Lights - Ground-level fixtures for uplighting. Step Lights - Illuminate stairs and level changes. String Lights - Create festive ambiance for patios and pergolas.</p><h2>Lighting Techniques</h2><p>Uplighting creates drama by illuminating trees or walls from below. Downlighting mimics natural moonlight filtering through trees. Silhouetting places lights behind objects to create dramatic outlines. Shadowing casts interesting shadows by placing lights in front of textured objects.</p><h2>Energy Efficiency</h2><p>LED fixtures offer the best energy efficiency and longevity. They produce minimal heat, come in various color temperatures, and last 15-20 years. Solar lights work for some applications but have limitations in Chicago's winters.</p><h2>Control Systems</h2><p>Modern outdoor lighting includes smart controls for scheduling, dimming, and remote operation. Timers ensure lights turn on at dusk and off at dawn automatically. Motion sensors add security while conserving energy.</p><h2>Professional Installation</h2><p>Proper installation ensures fixtures are weatherproof, properly aimed, and integrated with your landscape design. We create lighting plans that enhance your property's beauty while meeting functional needs.</p>"
  },
  {
    "id": 10,
    "slug": "fall-lawn-care-guide-for-chicago-homeowners",
    "title": "Fall Lawn Care Guide for Chicago Homeowners",
    "date": "2024-01-25",
    "intro": "Fall is the most important season for lawn care in Chicago. Learn the essential tasks that will give you a lush, healthy lawn next spring.",
    "content": "<p>Many homeowners think lawn care ends after summer, but fall is actually the most critical season for Chicago lawns. Cool-season grasses that dominate our area grow most actively in fall, making it the ideal time for crucial maintenance tasks.</p><h2>Core Aeration</h2><p>Aeration removes small plugs of soil, allowing oxygen, water, and nutrients to reach grass roots. This is essential for lawns with heavy clay soil or high traffic. Best done in September or early October when grass is actively growing.</p><h2>Overseeding</h2><p>Fall is the perfect time to thicken your lawn by overseeding. The warm soil and cool air provide ideal germination conditions. Choose quality seed blends appropriate for Chicago's climate and your sun/shade conditions.</p><h2>Fertilization</h2><p>Apply a fall fertilizer high in nitrogen to encourage root growth. This fall feeding helps grass store nutrients for winter survival and early spring green-up. Apply in late September or October before the ground freezes.</p><h2>Leaf Management</h2><p>Don't let leaves smother your grass. Rake or mulch regularly throughout fall. Light leaf cover can be mulched with a mower, but thick layers need removal to prevent disease and suffocation.</p><h2>Final Mowing</h2><p>Keep mowing until grass stops growing (usually late November). Gradually lower your mowing height to 2-2.5 inches for the last cut. This helps prevent snow mold and other winter diseases.</p><h2>Weed Control</h2><p>Fall is ideal for controlling perennial weeds like dandelions. They're actively moving nutrients to roots, so herbicides are most effective now.</p>"
  },
  {
    "id": 11,
    "slug": "choosing-the-right-mulch-for-chicago-gardens",
    "title": "Choosing the Right Mulch for Chicago Gardens",
    "date": "2024-01-20",
    "intro": "Mulch is essential for healthy Chicago gardens, but choosing the right type matters. Compare different mulch materials and learn proper application techniques.",
    "content": "<p>Mulch does more than make your garden beds look tidy. It conserves moisture, regulates soil temperature, suppresses weeds, and gradually improves soil as it decomposes. Choosing the right mulch for your Chicago landscape depends on your plants, aesthetic preferences, and budget.</p><h2>Shredded Hardwood Mulch</h2><p>The most popular choice for Chicago landscapes. Available in natural, brown, or black. Lasts 1-2 years before needing refreshing. Excellent for trees, shrubs, and perennial beds. Cost-effective and readily available.</p><h2>Cedar Mulch</h2><p>Natural insect-repelling properties. Pleasant aroma. Light color brightens shady areas. More expensive than hardwood but lasts longer. Excellent for vegetable gardens and foundation plantings.</p><h2>Pine Bark Mulch</h2><p>Available in nuggets (large pieces) or mini nuggets. Decorative appearance. Floats less than shredded mulch during heavy rains. Good for sloped areas. Takes longer to decompose, lasting 2-3 years.</p><h2>Rubber Mulch</h2><p>Made from recycled tires. Lasts indefinitely, never needs replacing. Available in various colors. Best for playgrounds and high-traffic areas. Doesn't add organic matter to soil.</p><h2>Stone and Rock</h2><p>Permanent solution that never needs replacing. Good for areas prone to heavy runoff. Works well with modern, minimalist designs. Available in many sizes and colors. Doesn't improve soil or provide nutrients.</p><h2>Application Tips</h2><p>Apply 2-3 inches deep for weed suppression. Keep mulch 2-3 inches away from plant stems and tree trunks. Refresh annually for best appearance and function. Apply in spring after soil warms up.</p>"
  },
  {
    "id": 12,
    "slug": "winter-landscaping-protecting-your-chicago-investment",
    "title": "Winter Landscaping: Protecting Your Chicago Investment",
    "date": "2024-01-15",
    "intro": "Chicago winters are harsh on landscapes. Learn how to protect your plants, hardscaping, and outdoor features from winter damage.",
    "content": "<p>Chicago's brutal winters can damage even the hardiest landscapes. Proper preparation in fall and protection through winter ensures your landscaping investment survives and thrives year after year.</p><h2>Protecting Plants</h2><p>Wrap young or tender trees and shrubs with burlap to shield from winter winds. Apply 3-4 inches of mulch around roots after ground freezes to insulate. Water evergreens thoroughly before ground freezes. Apply anti-desiccant spray to broadleaf evergreens.</p><h2>Hardscape Protection</h2><p>Seal concrete pavers and natural stone before winter to prevent freeze-thaw damage. Avoid using rock salt on pavers and concrete - use calcium chloride instead. Keep hardscapes clear of ice to prevent staining and damage. Store patio furniture or cover to extend its life.</p><h2>Irrigation Systems</h2><p>Blow out irrigation lines before first hard freeze (typically late October). Drain backflow preventers and above-ground components. Insulate exposed pipes and valves. Mark sprinkler head locations for easy spring startup.</p><h2>Water Features</h2><p>Remove pumps and store indoors. Drain all water lines. Cover ponds if you have fish (leave partially open for gas exchange). Add de-icer to maintain a hole in pond ice. Net ponds to keep out debris.</p><h2>Winter Interest</h2><p>Leave ornamental grass plumes and perennial seed heads for winter beauty and wildlife. Plant trees and shrubs with interesting bark for winter appeal. Add evergreens for year-round structure and color.</p>"
  },
  {
    "id": 13,
    "slug": "creating-privacy-with-landscaping-chicago-solutions",
    "title": "Creating Privacy with Landscaping: Chicago Solutions",
    "date": "2024-01-10",
    "intro": "Need more privacy in your Chicago yard? Explore natural landscaping solutions from evergreen hedges to living walls that screen unwanted views.",
    "content": "<p>Urban and suburban Chicago properties often lack privacy. Strategic landscaping can create natural screens that are more attractive and often more effective than fences.</p><h2>Evergreen Privacy Screens</h2><p>Arborvitae (Thuja) - Most popular privacy hedge in Chicago. Green Giant variety grows 3-4 feet per year. Extremely cold hardy. Plant 3-5 feet apart for solid screen. Mature height 15-25 feet.</p><p>Holly (Ilex) - Glossy evergreen leaves and red berries. Slower growing but very dense. Excellent for partial shade. Various sizes available.</p><h2>Deciduous Privacy Solutions</h2><p>Hedge Maple (Acer campestre) - Dense branching provides screening even without leaves. Beautiful fall color. Tolerates heavy pruning. Can be maintained at 6-15 feet.</p><p>Hornbeam (Carpinus) - Creates elegant formal hedges. Holds brown leaves through winter providing year-round screening. Very refined appearance.</p><h2>Mixed Border Screens</h2><p>Combining evergreens with flowering shrubs creates dynamic privacy screens with seasonal interest. Include plants with different bloom times and fall colors. Layer plants at different heights for depth.</p><h2>Living Walls and Green Screens</h2><p>Climbing vines on trellises or fences create quick vertical screening. Boston Ivy and Virginia Creeper are cold-hardy options. Clematis adds beautiful flowers. Annual vines like morning glory provide fast seasonal coverage.</p><h2>Installation Spacing</h2><p>For privacy, plant closer than recommended mature spacing. For immediate screening, expect to pay more for larger specimens. Full privacy typically takes 3-5 years depending on plant choice and size installed.</p>"
  },
  {
    "id": 14,
    "slug": "xeriscaping-water-wise-landscaping-for-chicago",
    "title": "Xeriscaping: Water-Wise Landscaping for Chicago",
    "date": "2024-01-05",
    "intro": "Reduce water usage while creating beautiful Chicago landscapes. Learn xeriscaping principles and discover drought-tolerant plants that thrive in our climate.",
    "content": "<p>While Chicago receives adequate rainfall, summer droughts are increasingly common. Xeriscaping reduces water dependency while creating resilient, low-maintenance landscapes.</p><h2>Seven Xeriscaping Principles</h2><p>1. Planning and Design - Group plants by water needs. 2. Soil Improvement - Amend with compost for water retention. 3. Appropriate Plant Selection - Choose drought-tolerant species. 4. Efficient Irrigation - Use drip systems or soaker hoses. 5. Mulch Application - 2-3 inches conserves moisture. 6. Limited Turf Areas - Reduce thirsty lawn areas. 7. Maintenance - Regular care keeps plants healthy and water-efficient.</p><h2>Drought-Tolerant Perennials</h2><p>Sedum (Stonecrop) - Succulent foliage, late summer flowers. Russian Sage - Silver foliage, blue flowers, deer resistant. Catmint - Long-blooming purple flowers, aromatic foliage. Daylilies - Tough, reliable, huge variety of colors. Coreopsis - Bright yellow flowers all summer.</p><h2>Drought-Tolerant Shrubs</h2><p>Potentilla - Continuous yellow flowers, compact size. Smokebush - Dramatic purple foliage and fuzzy flower plumes. Juniper - Evergreen, many sizes and forms available. Butterfly Bush - Attracts pollinators, comes in many colors.</p><h2>Lawn Alternatives</h2><p>Replace thirsty bluegrass with drought-tolerant fescue blends. Consider clover lawns that stay green without irrigation. Use groundcovers like creeping thyme in low-traffic areas. Install artificial turf for no-water green spaces.</p><h2>Irrigation Efficiency</h2><p>Water deeply but infrequently to encourage deep roots. Water early morning to reduce evaporation. Use rain barrels to capture free water. Install smart controllers that adjust to weather.</p>"
  },
  {
    "id": 15,
    "slug": "edible-landscaping-growing-food-in-chicago-yards",
    "title": "Edible Landscaping: Growing Food in Chicago Yards",
    "date": "2023-12-30",
    "intro": "Combine beauty with function by incorporating edible plants into your Chicago landscape. Learn which fruits, vegetables, and herbs work best ornamentally.",
    "content": "<p>Edible landscaping blends food production with ornamental gardening. The result is a beautiful landscape that also provides fresh produce, herbs, and berries.</p><h2>Edible Perennials</h2><p>Asparagus - Ferny foliage looks ornamental in borders. Harvest spears in spring. Productive for 15-20 years. Rhubarb - Large tropical-looking leaves make bold statements. Harvest stalks for pies and desserts. Very cold hardy. Strawberries - Excellent groundcover with spring flowers and summer fruit. Everbearing varieties produce all season.</p><h2>Fruit Trees and Shrubs</h2><p>Apple - Many dwarf varieties suit small yards. Beautiful spring blossoms. Choose disease-resistant varieties. Blueberries - Stunning fall color and spring flowers. Require acidic soil. Plant multiple varieties for cross-pollination. Serviceberry - Native shrub with edible berries. White spring flowers and fall color. Wildlife friendly.</p><h2>Ornamental Herbs</h2><p>Lavender - Fragrant purple flowers and silvery foliage. Use in cooking and crafts. Rosemary - Can be shaped into topiaries or hedges. Harvest year-round in milder winters. Chives - Purple pom-pom flowers in spring. Self-seeds readily. Both leaves and flowers are edible. Sage - Silver-purple foliage adds texture. Purple flower spikes attract pollinators.</p><h2>Decorative Vegetables</h2><p>Rainbow chard - Colorful stems in red, yellow, orange, and pink. Purple cabbage - Dramatic foliage color. Scarlet runner beans - Bright red flowers on attractive vines. Produces edible beans.</p><h2>Design Tips</h2><p>Integrate edibles into existing borders - they don't need separate vegetable gardens. Use herbs as border edging. Train fruit trees as espaliers along fences. Plant edible flowers like nasturtiums and calendulas for color.</p>"
  }
]
